---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.RiserHeight
source: html/2650aa7a-88d7-a48b-d755-b36bedfcc4bd.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.RiserHeight Property

The height of riser.

## Syntax (C#)
```csharp
public double RiserHeight { get; }
```